[LanguageDefinition]

LanguageID = English

Title ="Редактор миров Digital Wizard's Lab"
TB_New = "Новый проект"
TB_Open = "Открыть проект"
TB_Save = "Сохранить проект"
TB_SaveAs = "Сохранить проект как"
TB_ShowGrid = "Показывать сетку"
TB_SnapToGrid = "Прилипать к сетке"
TB_GridSettings = "Настройки сетки"
TB_AutoChangementOfTiles = "Автозамена тайлов"
TB_ProlongTiles = "Продолжать тайлы"

B_AddLayer = "Добавить слой"
L_X = "X:"
L_Y = "Y:"
L_Width = "Шир:"
L_Height = "Выс:"
L_Shape = "Форма:"
L_Angle = "Угол:"
L_Velocity = "Скор:"
L_Alpha = "Прозр:"
L_Red = "Красн:"
L_Green = "Зелен:"
L_Blue = "Синий:"
L_XScale = "XМсшт:"
L_YScale = "YМсшт:"
L_Frame = "Кадр:"
B_SelectImage = "Выбрать изобр."
CB_Rotation = "Пов."
CB_Scaling = "Мс."
L_ImageAngle = "Угол изоб:"

M_File = "Файл"
M_New = "Новый проект"
M_Open = "Открыть проект..."
M_Save = "Сохранить проект..."
M_SaveAs = "Сохранить проект как..."
M_Exit = "Выход"
M_Edit = "Правка"
M_ShowGrid = "Показать сетку"
M_SnapToGrid = "Прилипать к сетке"
M_GridSettings = "Настройки сетки"
M_ReplacementOfTiles = "Автозамена тайлов"
M_ProlongTiles = "Продолжать тайлы"
M_Language = "Язык"
M_English = "Английский"
M_Russian = "Русский"

M_Select = "Выбрать"
M_AddLayer = "Добавить слой"
M_AddTilemap = "Добавить тайловую карту"
M_ImportTilemap = "Импортировать тайловую карту"
M_ImportTilemaps = "Импортировать тайловые карты"
M_RemoveBounds = "Убрать ограничения"
M_EditTilemap = "Редактировать"
M_ToggleVisibility = "Переключить видимость (V)"
M_ToggleActivity = "Переключить активность (A)"
M_TileMapSettings = "Свойства"
M_EditTileset = "Редактировать изображение тайлсета"
M_EditTileReplacementRules = "Редактировать правила автозамены тайлов"
M_SetBounds = "Установить как границу текущего слоя"
M_Rename = "Переименовать"
M_ShiftToTheTop = "На задний план (Home)"
M_ShiftUp = "Сдвинуть назад (PgUp)"
M_ShiftDown = "Сдвинуть вперед (PgDn)"
M_ShiftToTheBottom = "На передний план (End)"
M_Remove = "Удалить"

D_UnsavedWorld = "Ваш проект не был сохранен, хотите ли вы сохранить его?"
D_SelectFileNameToSave = "Выберите название проекта для сохранения..."
D_EnterNameOfObject = "Введите название объекта"
D_SelectFileNameToOpen = "Выберите название проекта для открытия..."
D_EnterNameOfLayer = "Введите название нового слоя:"
D_EnterNameOfTilemap = "Введите название новой тайловой карты:"
L_TileSize = "размер тайла"
L_Pixels = "пикс."
D_SelectTilemapFile = "Выберите изображение-тайловую карту для обработки..."
N_CannotLoadTilemap = "Невозможно загрузить изображение."
N_TilemapSize = "Размеры изображения-тайловой карты должны делиться на размеры тайла."
D_SelectTilemapsDirectory = "Выберите директорию с файлами-изображениями тайловых карт..."
D_SelectFileToSaveImageTo = "Выберите файл изображжения, в который будет сохранен тайлсет..."
I_Pivot = "Точка"
I_Circle = "Круг"
I_Rectangle = "Прямоугольник"
L_TilesQuantity = "кол-во тайлов"
L_Tiles = "тайлов"
L_Choose = "Выберите"
B_OK = "OK"
B_Cancel = "Отмена"
N_MustBeMoreZero = " должен быть больше 0"
B_LoadImage = "Загрузить изображение"
W_SpriteTypeProperties = "Свойства изображения спрайта"
L_HorizontalCells = "Ячейки по горизонтали:"
L_VerticalCells = "Ячейки по вертикали:"
D_SelectImage = "Выберите изображение... "
N_ImageDivideable = "Размеры изображения должны делиться на количество клеток"
N_TileCellsQuantityMoreThanZero = "Количество клеток с тайлами должно быть больше 0"
N_ImageRequired = "Необходимо загрузить изображение"
W_TilesetEditor = "Редактор правил автозаполнения тайлов"
B_AddCategory = "Добавить категорию"
M_RenameCategory = "Переименовать"
M_CopyCategory = "Копировать"
M_RemoveCategory = "Удалить"
M_AddTileRule = "Добавить правило"
M_RemoveTileRule = "Удалить"
M_ShiftTileRuleUp = "Сдвинуть вверх (PgUp)"
M_ShiftTileRuleDown = "Сдвинуть вниз (PgDown)"
L_XDivider = "XДелитель:"
L_YDivider = "YДелитель:"
D_EnterNameOfNewCategory = "Введите название новой категории:"
D_EnterTileShift = "Введите смещение тайлов:"
D_EnterNameOfCategory = "Введите название категории:"